updated Read me files and removed un-necessary files
